{
    "about": "من نحن",
    "services": "الخدمات",
    "contact": "تواصل معنا",
    "blog": "مدونة",
    "hero_title": "نترجم رؤيتك إلى منتج تقني فعّال، من الفكرة وحتى الإطلاق.",
    "hero_subtitle": "PyMaster هي حاضنة تقنية وريادية تقدم دعمًا كاملاً من الفكرة إلى الإطلاق: التحقق، التطوير، العلامة التجارية، التسويق والبنية التحتية.",
    "services_title": "خدماتنا",
    "services_list": [
        {
            "title": "مرافقة ريادية",
            "desc": "من الفكرة إلى الإطلاق: تحليل السوق، خارطة الطريق، خطة العمل، واستراتيجية النمو."
        },
        {
            "title": "تنظيم هاكاثونات",
            "desc": "بناء الفكرة، الإدارة اللوجستية، تجنيد الشركاء والرعاة، وتنظيم اليوم الكامل."
        },
        {
            "title": "دورات وتدريب",
            "desc": "دروس خاصة وجماعية، مساعدة في المشاريع، تحضير للامتحانات وماراثونات أونلاين."
        },
        {
            "title": "تطوير مشاريع شخصية",
            "desc": "بناء ملف أعمال للسيرة الذاتية: تخطيط، كتابة كود نظيف، ونشر احترافي."
        },
        {
            "title": "استشارات أعمال",
            "desc": "توجيه، جلسات شخصية، ملاءمة الاستراتيجية، وتفكير تجاري مستمر."
        },
        {
            "title": "العلامة التجارية والديجيتال",
            "desc": "الاسم، الدومين، التصميم، الصفحة التعريفية، SEO، الحملات، وصوت العلامة."
        }
    ],
    "contact_title": "تواصل معنا",
    "contact_description": "يسعدنا سماعك! أرسل لنا رسالة، احجز مكالمة، أو تعال على فنجان قهوة ☕",
    "contact_form_name": "الاسم الكامل",
    "contact_form_phone": "رقم الهاتف",
    "contact_form_email": "البريد الإلكتروني",
    "contact_form_message": "سؤالك أو رسالتك",
    "contact_form_submit": "أرسل الرسالة",
    "blog_title": "مدونة PyMaster",
    "blog_description": "تابع مقالات حصرية، نصائح، ودروس ملهمة في ريادة الأعمال، البرمجة، والتكنولوجيا الحديثة – من خبراء PyMaster.",
    "blog_cta": "زيارة المدونة",
    "footer_text": "PyMaster © 2025 — حيث تولد الأفكار وتُبنى الحلول.",
    "about_title": "حول PyMaster",
    "about_paragraph_1": "تأسست PyMaster في 28 يناير 2025 كمبادرة خاصة لتعليم البرمجة. بدأنا بالدروس الخصوصية والمساعدة في الامتحانات، ومع مرور الوقت قمنا بمرافقة أكثر من 120 طالبًا في الجامعات والكليات في جميع أنحاء البلاد — بما في ذلك الجامعة العبرية، جامعة حيفا، جامعة تل أبيب، جامعة بن غوريون، التخنيون وغيرها.",
    "about_paragraph_2": "على طول الطريق، أنشأنا ماراثونًا فريدًا من نوعه بأسلوب تعليمي حديث ومستقبلي. تلقى المشاركون ملفات .pymaster تفاعلية تحتوي على أكثر من 80 سؤالًا بمستوى امتحان، مع تلميحات وحلول كاملة – بأسلوب ممتع ومنظم.",
    "about_paragraph_3": "ثم توسعنا إلى مجال مرافقة ريادة الأعمال: حولنا الأفكار إلى واقع من خلال التحقق، البحث، التطوير، الإطلاق، والمرافقة التسويقية. ساعدنا مشاريع بمستويات عليا في بناء منصات مخصصة من الألف إلى الياء – بما في ذلك الواجهة، الكود، العلامة التجارية، والحضور الرقمي.",
    "about_paragraph_4": "اليوم، PyMaster هي أكثر بكثير من مجرد دورات برمجة – إنها بيئة مهنية متكاملة لتخطيط، بناء، ونمو الأفكار في عالم التكنولوجيا.",
    "back_to_home": "العودة للصفحة الرئيسية",
    "blog_intro": "اقرأ مقالاتنا وآخر التحديثات في البرمجة، ريادة الأعمال، التجارب الواقعية، ونصائح احترافية للتعلم والابتكار.",
    "blog_post_1_title": "كيف تبدأ في تعلم البرمجة وتحافظ على الحافز",
    "blog_post_1_desc": "دليل عملي للمبتدئين: من أين تبدأ، كيف لا تستسلم، وأي لغات يجب تعلمها.",
    "blog_post_2_title": "بناء مشروع شخصي لسيرتك الذاتية",
    "blog_post_2_desc": "لماذا هو مهم، كيف تختار فكرة ناجحة، وكيف تعرضها باحتراف.",
    "blog_post_3_title": "ما وراء كواليس ماراثون PyMaster",
    "blog_post_3_desc": "هكذا أنشأنا تجربة تعليمية فريدة باستخدام ملفات ذكية وتلميحات وإجابات تفاعلية.",
    "blog_read_more": "اقرأ المزيد →",
    "no_blog_posts": "لا توجد مقالات حتى الآن، تابعنا للحصول على آخر التحديثات!",
    "loading": "جارٍ التحميل...",
    "no-title-found": "لم يتم العثور على عنوان",
    "no-content-found": "لم يتم العثور على محتوى",
    "by": "بواسطة",
    "back_to_blog": "العودة إلى المدونة",
    "sending_message": "جارٍ إرسال الرسالة...",
    "message_sent_success": "تم إرسال رسالتك بنجاح! سنرد عليك قريبًا."
}