{
    "about": "עלינו",
    "services": "שירותים",
    "contact": "צור קשר",
    "blog": "בלוג",
    "hero_title": "אנחנו מתרגמים את החזון שלך למוצר טכנולוגי אמיתי – מהרעיון ועד ההשקה.",
    "hero_subtitle": "PyMaster היא חממה טכנולוגית ועסקית הכוללת ליווי מלא מרגע לידת רעיון ועד השקת מוצר: אימות, פיתוח, מיתוג, שיווק ותשתיות.",
    "services_title": "השירותים שלנו",
    "services_list": [
        {
            "title": "ליווי יזמות",
            "desc": "מהרעיון ועד ההשקה: ניתוח שוק, מפת דרכים, תוכנית עסקית ואסטרטגיית צמיחה."
        },
        {
            "title": "הפקת האקתונים",
            "desc": "בניית נושא, ניהול לוגיסטי, גיוס שותפים וספונסרים, וניהול מלא של יום האירוע."
        },
        {
            "title": "הדרכות וקורסים",
            "desc": "שיעורים פרטיים, קבוצתיים, עזרה בפרויקטים, הכנה למבחנים ומרתונים אונליין."
        },
        {
            "title": "פיתוח פרויקטים אישיים",
            "desc": "בניית פורטפוליו לקורות חיים: תכנון, כתיבת קוד איכותי, ופרסום מקצועי."
        },
        {
            "title": "ייעוץ עסקי",
            "desc": "הכוונה, פגישות אישיות, התאמת אסטרטגיה וחשיבה עסקית לאורך הדרך."
        },
        {
            "title": "מיתוג ודיגיטל",
            "desc": "שם, דומיין, עיצוב, דף נחיתה, SEO, קמפיינים וקול מותג שמדבר ללב."
        }
    ],
    "contact_title": "צור קשר",
    "contact_description": "נשמח לשמוע ממך! שלח לנו הודעה, תאם שיחה או קפוץ לקפה ☕",
    "contact_form_name": "שם מלא",
    "contact_form_phone": "מספר טלפון",
    "contact_form_email": "כתובת אימייל",
    "contact_form_message": "השאלה או ההודעה שלך",
    "contact_form_submit": "שלח הודעה",
    "blog_title": "בלוג PyMaster",
    "blog_description": "בבלוג שלנו תמצאו טיפים, מדריכים, השראה וסיפורי הצלחה שיעזרו לכם לצמוח כיזמים ומפתחים בעולם הטכנולוגי.",
    "blog_cta": "למעבר לבלוג",
    "footer_text": "PyMaster © 2025 — רעיונות שנולדים. פתרונות שנוצרים.",
    "about_title": "אודות PyMaster",
    "about_paragraph_1": "PyMaster נוסדה ב-28 בינואר 2025 כיוזמה פרטית ללימוד תכנות. התחלנו עם שיעורים פרטיים בקוד ועזרה במבחנים, ועם הזמן ליווינו מעל 120 סטודנטים באוניברסיטאות ומכללות ברחבי הארץ — האוניברסיטה העברית בירושלים, אוניברסיטת חיפה, אוניברסיטת תל אביב, אוניברסיטת בן-גוריון, הטכניון ועוד.",
    "about_paragraph_2": "במהלך הדרך יצרנו מרתון ראשון מסוגו עם גישה מודרנית ועתידנית ללמידה. המשתתפים קיבלו קבצי .pymaster אינטראקטיביים שהכילו מעל 80 שאלות ברמת מבחן כולל רמזים ופתרונות מלאים – הכל בצורה חווייתית, ממוקדת ומובנית.",
    "about_paragraph_3": "לאחר מכן התרחבנו לתחום הליווי היזמי: הפכנו רעיונות למציאות על ידי ולידציה, מחקר, פיתוח, השקה וליווי שיווקי. עזרנו גם למיזמים עם פרופילים בכירים לבנות פלטפורמות מותאמות אישית מקצה לקצה – כולל ממשקים, קוד, מיתוג ונוכחות דיגיטלית.",
    "about_paragraph_4": "היום PyMaster היא הרבה יותר מקורסי תכנות – היא סביבה מקצועית מלאה לתכנון, בנייה וצמיחה של רעיונות בעולם הטכנולוגי.",
    "back_to_home": "חזרה לדף הבית",
    "blog_intro": "קרא את המאמרים והעדכונים שלנו בתחום התכנות, יזמות, חוויות מהשטח וטיפים מקצועיים ללמידה וחדשנות.",
    "blog_post_1_title": "איך להתחיל ללמוד תכנות ולשמור על מוטיבציה",
    "blog_post_1_desc": "מדריך מעשי למתחילים: מאיפה מתחילים, איך לא להישבר, ואילו שפות כדאי ללמוד.",
    "blog_post_2_title": "פיתוח פרויקט אישי לתיק העבודות שלך",
    "blog_post_2_desc": "למה זה חשוב, איך לבחור רעיון מנצח, ואיך להציג אותו כמו מקצוען.",
    "blog_post_3_title": "מאחורי הקלעים של מרתון PyMaster",
    "blog_post_3_desc": "כך יצרנו חוויית למידה יוצאת דופן עם קבצים חכמים, רמזים ותשובות אינטראקטיביות.",
    "blog_read_more": "קרא עוד →",
    "no_blog_posts": "אין עדיין פוסטים, עקבו אחרינו לעדכונים האחרונים!",
    "loading": "טוען...",
    "no-title-found": "לא נמצא כותרת",
    "no-content-found": "לא נמצא תוכן",
    "by": "מאת",
    "back_to_blog": "חזרה לבלוג",
    "sending_message": "שולח הודעה...",
    "message_sent_success": "ההודעה שלך נשלחה בהצלחה! נחזור אליך בהקדם."
}